[
  {
    "name": "Renaldi Gondosubroto",
    "title": "Director at Cloudetica Solutions",
    "type": "regular",
    "imageName": "renaldi-gondosubroto",
    "socialUrl": [
      "https://x.com/Renaldig",
      "https://www.renaldigondosubroto.com",
      "https://www.linkedin.com/in/renaldi-gondosubroto"
    ],
    "bio": "Renaldi Gondosubroto is the Director of Cloudetica Solutions, where he leads the building of both proprietary and open-source solutions on cloud platforms. He brings over a decade of software development experience and has been active within the research community; putting a lot of his research focus within IoT and virtual reality. Having spoken over 50 events and conferences, he has been an international speaker for the past six years, sharing his experiences and projects. He also currently is an AWS Subject Matter Expert (SME) for its Professional, Associate and Specialty Certifications and holds all 14 AWS certifications. He aims to build open-source solutions which can both help people achieve more value in what they do and promote best practices for fellow developers.",
    "talk": {
      "title": "Certified Answers for RAG: Cryptographic Receipts that Prove What Your AI Says",
      "description": "Stop hallucinations by default. This talk shows how to make every AI answer carry a verifiable receipt that proves which sources were used, what was quoted, and why it is trustworthy. We build a zero-trust RAG service that signs and checks proofs before responses reach users.",
      "topics": ["Research", "Deep-Dive"]
    }
  },
  {
    "name": "Hilman Ramadhan",
    "title": "Founder & Developer at Sekolah Koding",
    "type": "regular",
    "imageName": "hilman-ramadhan",
    "socialUrl": [
      "https://www.linkedin.com/in/hilmanski",
      "https://hilman.space/"
    ],
    "bio": "Hi! I'm a programmer that loves marketing. I'm currently working at SerpApi - SearchApi and teach at Skodev - place to learn programming in Indonesian language.",
    "talk": {
      "title": "Build, Share, Connect: Perlihatkan karyamu",
      "description": "Katanya lowongan kerja untuk programmer makin sempit karena AI makin canggih. Bagaimana kamu bisa standout dari programmer lain ketika angka loker semakin kecil?",
      "topics": ["Society"]
    }
  },
  {
    "name": "Evan Purnama",
    "title": "Co-Founder at Qiscus",
    "type": "regular",
    "imageName": "evan-purnama",
    "socialUrl": [
      "https://www.linkedin.com/in/evan-purnama-49266a62/",
      "https://x.com/evanpurnama",
      "https://twitter.com/evanpurnama"
    ],
    "bio": "Evan Purnama, born and grow up in Jogja. Went to Singapore and graduated in 3.5 years from NTU and worked at some IT companies in Singapore before decided to start his own startup tech company in early 2013, Qiscus. Evan then moved back to Indonesia (Jogja) in mid 2013 to open Engineering Team. He is also active in TechTalk (already held 100+ talks so far) and startup communities in Jogja and Semarang.",
    "talk": {
      "title": "Balancing AI Innovation & Profit: The CTO Playbook for Two-Speed Organizations",
      "description": "Drive tech org amid AI fast trend: as CTO, I built a pragmatic AI team. Research new trends, deliver AI tied to core products (e.g various AI Agent), and Advocate adoption AI. Result? strong double digit % revenue growth while staying profitable in this economy. Unlock the two-speed playbook!",
      "topics": ["Leadership", "Strategic"]
    }
  },
  {
    "name": "Zain Fathoni",
    "title": "Senior Software Engineer at BookThatApp",
    "type": "regular",
    "imageName": "zain-fathoni",
    "socialUrl": [
      "https://x.com/zainfathoni",
      "https://www.linkedin.com/in/zainfathoni/",
      "https://www.zainfathoni.com/",
      "https://zainfathoni.com/"
    ],
    "bio": "Zain Fathoni is a software engineer and homeschooling parent of three. By day, he builds web applications. By night, he experiments with AI tools alongside his children—sometimes laughing at their mistakes, sometimes amazed by their insights. With a strong background in technology and hands-on parenting, Zain explores how families can leverage AI to enhance learning while preserving human connection. His mission is to empower parents to raise children who are resilient, curious, and ready to outthink the machines.",
    "talk": {
      "title": "Raising Children Who Outthink the Machines",
      "description": "Are you worried machines 🤖 might take your kids' jobs? Do you fear AI could bring a dystopia 💣 instead of a utopia ✨? Do you struggle to protect your children's attention from gadgets 📱—and their minds 🧠 from AI? Let's turn fear into optimism ✨ and raise kids who outthink the machines 💪.",
      "topics": ["Society"]
    }
  },
  {
    "name": "Yohan Totting",
    "title": "Head of Engineering (AI) at SIRCLO",
    "type": "regular",
    "imageName": "yohan-totting",
    "socialUrl": ["https://x.com/tyohan", "https://www.linkedin.com/in/tyohan"],
    "bio": "Head of Engineering (AI) of Sirclo, an Indonesia e-commerce enabler, founder and creator of Inlive, a video conferencing platform. Currently learning on how to build and control an AI agents. In the missions to make AI coding agent can more accessible for Indonesia developers. Enjoying running around BSD, but sometimes doing trail runs at Sentul, or gravel ride around Rumpin.",
    "talk": {
      "title": "Under the Hood: Building AI Coding Assistants, Understand the Mechanics to Unleash Their Power",
      "description": "Understand the mechanics of coding assistant will help us maximize their power. This talk will cover what you need to know if you want to build your own, from fundamental knowledge of LLM, context engineering, and how to give right tools to improve the performance and accuracy of coding assistant.",
      "topics": ["Productivity", "Deep-dive"]
    }
  },
  {
    "name": "Iskandar Soesman",
    "title": "Co-Founder of Awanio",
    "type": "regular",
    "imageName": "iskandar-soesman",
    "socialUrl": ["https://www.linkedin.com/in/ikandars", "https://awan.io/"],
    "bio": "Write code since 2008. Maintainer of Panada, and open source PHP framework 2009 - 2015. Co-founder of Awanio, A Cloud Enabler Platform to simplify resources management",
    "talk": {
      "title": "Building Production-Ready Infrastructure Tools 10x Faster with AI Agents: The Vapor Story",
      "description": "Discover how AI agents helped build Vapor, an open source comprehensive platfrom for managing modern Linux stacks, in just months instead of years. Learn practical strategies for leveraging AI to accelerate complex software development while maintaining enterprise-grade quality.",
      "topics": ["Productivity"]
    }
  },
  {
    "name": "Rully Saputra",
    "title": "Software Engineer II at Tiket",
    "type": "regular",
    "imageName": "rully-saputra",
    "socialUrl": [
      "https://www.linkedin.com/in/rully-saputra-7554a7138",
      "https://medium.com/@rully.saputra4"
    ],
    "bio": "Specializing in software engineering with over 5 years of hands-on experience. In addition to my expertise in web development, I also have experience in creating Hybrid mobile apps. Fuelled by my deep passion for programming and system design, I am driven to create large-scale systems that leave a lasting impact. My ultimate ambition is to develop applications on par with the likes of Instagram, YouTube, TikTok, and other prominent platforms. Given the rapid pace of the IT industry, I remain agile and stay hungry for new technologies and opportunities. I am always seeking to expand my knowledge base and stay at the forefront of emerging trends. My dedication to continuous learning ensures that I deliver precise solutions and remain adaptable in this ever-evolving field.",
    "talk": {
      "title": "Smart Monitoring System for Core Web Vitals using n8n",
      "description": "Maximize website performance with n8n automation! This process fetches Lighthouse reports, audits Core Web Vitals, sends real-time notifications to your team, and logs concise insights to Google Sheets—perfect for devs, SEOs, and product teams who need speed, clarity, and continuous monitoring.",
      "topics": ["Productivity"]
    }
  },
  {
    "name": "Guntur A. Fauzi",
    "title": "Solutions Architect",
    "type": "regular",
    "imageName": "guntur-a-fauzi",
    "socialUrl": ["https://www.linkedin.com/in/gunturaf/"],
    "bio": "Guntur Akhmad Fauzi is a Solution Architect based in Jakarta, with a strong track record of driving enterprise-scale digital transformation initiatives. At a leading global FMCG company, Guntur plays a key role in designing and scaling AI-powered solutions that align with business strategy, regulatory compliance, and operational excellence. With a background in systems architecture and cross-functional collaboration, Guntur has contributed to initiatives involving AI governance, data protection, and responsible innovation. His work bridges the gap between technical feasibility and business impact—ensuring that emerging technologies are deployed safely, legally, and with reputational integrity. Guntur is passionate about building pragmatic frameworks that empower teams to innovate confidently while navigating complex enterprise environments. He frequently collaborates with product, compliance, and engineering teams to translate strategic goals into scalable, secure solutions.",
    "talk": {
      "title": "Balancing Speed and Safety: AI Governance at Scale in Global FMCG",
      "description": "In a global FMCG, AI governance enables safe, scalable innovation. Structured paths ensure legal and reputational integrity; Fast-Track options offer agility. Together, they empower teams to innovate responsibly while seizing market momentum.",
      "topics": ["Leadership"]
    }
  },
  {
    "name": "Rendy B. Junior",
    "title": "VP of Data at Evermos",
    "type": "keynote",
    "imageName": "rendy-b-junior",
    "socialUrl": [
      "https://www.linkedin.com/in/rendybjunior/",
      "https://x.com/rendybjunior"
    ],
    "bio": "VP of Data at Evermos, passionate about delivering business value through data and technology. Previously delivered insights at Ruangguru and built data infrastructure at Traveloka.",
    "talk": null
  },
  {
    "name": "Ayu Purwarianti",
    "title": "Associate Professor & AI Researcher at ITB",
    "type": "keynote",
    "imageName": "ayu-purwarianti",
    "socialUrl": [
      "https://www.linkedin.com/in/ayu-purwarianti/",
      "https://x.com/AyuP_AI"
    ],
    "bio": "Researcher at ITB's AI Center and lecturer in Electrical & Informatics Engineering. Doctorate from Toyohashi University of Technology. Co-founder of Prosa.ai, focused on AI, NLP, and machine learning. Leads NusaCrowd and IndoNLU for Indonesian language technology.",
    "talk": null
  },
  {
    "name": "Sandhika Galih",
    "title": "Content Creator & Lecturer at Universitas Pasundan",
    "type": "keynote",
    "imageName": "sandhika-galih",
    "socialUrl": [
      "https://www.youtube.com/@sandhikagalihWPU",
      "https://x.com/sandhikagalih"
    ],
    "bio": "Indonesia's largest Software Engineering YouTube Content Creator, Lecturer at Universitas Pasundan, and Co-Founder of WPU Course. Google Developer Expert in software engineering education.",
    "talk": null
  },
  {
    "name": "Pahlevi Fikri Auliya",
    "title": "Associate Vice President at Ruangguru",
    "type": "keynote",
    "imageName": "pahlevi-fikri-auliya",
    "socialUrl": [
      "https://www.linkedin.com/in/pahleviauliya/",
      "https://x.com/_fikri_auliya"
    ],
    "bio": "Associate Vice President at Ruangguru, Southeast Asia's largest ed-tech company with 150+ engineers. Leads multiple teams while balancing roles as people manager, project manager, and technical architect.",
    "talk": null
  },
  {
    "name": "Listiarso Wastuargo",
    "title": "Tech Entrepreneur",
    "type": "talkshow",
    "imageName": "listiarso-wastuargo",
    "socialUrl": [
      "https://x.com/lwastuargo",
      "https://www.linkedin.com/in/lwastuargo/"
    ],
    "talk": null
  },
  {
    "name": "Bagas Naufal Insani",
    "title": "Senior Full-Stack Engineer at Digication",
    "type": "talkshow",
    "imageName": "bagas-naufal-insani",
    "socialUrl": [
      "https://x.com/BagasN7",
      "https://www.linkedin.com/in/bagasnaufalinsani"
    ],
    "talk": null
  },
  {
    "name": "Hilman Ramadhan",
    "title": "Customer Success Director at SerpApi",
    "type": "regular",
    "imageName": "hilman-ramadhan",
    "socialUrl": [
      "https://www.linkedin.com/in/hilmanski",
      "https://hilman.space/"
    ],
    "bio": "Hi! I'm a programmer that loves marketing. I'm currently working at SerpApi - SearchApi and teach at Skodev - place to learn programming in Indonesian language.",
    "talk": {
      "title": "Real-Time Web Search for AI tools",
      "description": "",
      "topics": ["Productivity", "Sponsor Session"]
    }
  },
  {
    "name": "Agung Darmawan",
    "title": "Senior Presales Solutions Architect at TrueWatch",
    "type": "regular",
    "imageName": "agung-darmawan",
    "socialUrl": [],
    "bio": "A seasoned technology leader with over 15 years of experience, Agung specializes in IT operations, cloud, and DevSecOps. He has helped organizations across sectors like finance and critical infrastructure improve digital resilience through his work at Splunk, GE Digital, and HP.",
    "talk": {
      "title": "Hidden LLM Failures and How to Find Them",
      "description": "",
      "topics": ["Productivity", "Sponsor Session"]
    }
  },
  {
    "name": "Bistok Diiel Lelono",
    "title": "Engineering Manager at Amartha",
    "type": "regular",
    "imageName": "bistok-diiel-lelono",
    "socialUrl": ["https://www.linkedin.com/in/bistokdl"],
    "bio": "Bistok Diiel Lelono has been Amartha’s Software Engineering Manager for over four years. With deep expertise in back-end engineering, he is hands-on in building, troubleshooting, and optimizing systems to deliver robust and scalable solutions.",
    "talk": {
      "title": "AI for Financial Inclusion",
      "description": "",
      "topics": ["Sponsor Session"]
    }
  }
]
